# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
1. to check their presence - isnull(),isna(),isna().sum()
2. to drop them
3. to fill them

In [4]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [6]:
df.dropna()#by default it will drop all the rows consisting of null values.

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis=1)#to drop coloumn wise

   C
0  1
1  2
2  3

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna(thresh=2)#Keep only the rows with at least 2 non-NA values.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [10]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [11]:
df["A"].mean()

1.5

In [12]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [13]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [14]:
df['A'].median()

1.5

In [15]:
df['C'].median()

2.0

In [16]:
df['A'].fillna(value=df['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [20]:
import pymysql